{
    "id": "2024-09-15-dalhousie-quantitative-finance-society",
    "date": "2024-01-01",
    "title": "Dalhousie Quantitative Finance Society",
    "role": "Founder & President",
    "projectDate": "July 2023 - August 2024",
    "description": "As the founder and president of the Dalhousie Quantitative Finance Society (DQFS), I established and led the first student organization that was dedicated to advancing quantitative finance education and professional development at Dalhousie University. My expertise in financial markets, econometric modeling, and quantitative analysis enabled me to create a platform that bridged academic theory with real-world industry applications.\n\nIn my role as president, I designed and implemented a strategic vision that transformed DQFS into one of the most influential student organizations on campus. I personally led various technical workshops covering Python programming for financial analysis, Excel VBA automation, derivatives pricing models, Power BI data visualization, discounted cash flow analysis, ROI calculations, and advanced quantitative methods. These hands-on sessions provided students with practical skills directly applicable to investment banking, asset management, and quantitative trading roles.\n\nMy leadership also extended to organizing high-profile networking events that connected students with executives and analysts from major investment banks, hedge funds, asset management firms, and quantitative trading companies. These events provided students with significant access to industry insights, career opportunities, and mentorship relationships that have proven invaluable for our members' professional development.\n\nMy ability to demonstrate the practical value of quantitative finance education helped secure funding and industry support, enabling DQFS to grow to over 150 active members.",
    "images": [
        "dalhousie-quantitative-finance-society/workshop-event.jpg",
        "dalhousie-quantitative-finance-society/networking-event.jpg"
    ],
    "skills": [
        "Python/NumPy/Pandas/Matplotlib",
        "Derivatives Pricing",
        "Excel VBA Automation",
        "Power BI Analytics"
    ]
}